from enum import Enum

class ItemList(Enum):
    # ! 거래량 하위 종목 3개
    진흥기업2우B = "002787" # 거래량 1
    # 대한화섬 = "003830" # 거래량 4
    # 금강공업우 = "014285" # 거래량 5

    # ! 거래량 상위 종목 30개
    #  연속 조회 시 총 조희 시간 0:12:43.47... (10개)
    # 아센디오 = "012170"
    # 삼성전자 = "005930"
    # 이수페타시스 = "007660"
    # 플레이그램 = "009810"
    # 동일고무벨트 = "163560"
    # 한화생명 = "088350"
    # 한농화성 = "011500"
    # SK하이닉스 = "000660"
    # 에이프로젠 = "007460"
    # 광명전기 = "017040"
    # 삼성중공업 = "010140"
    # 국보 = "001140"
    # 유니퀘스트 = "077500"
    # KIB플러그에너지 = "015590"
    # 에이프로젠바이오로직스 = "003060"
    # HD현대인프라코어 = "042670"
    # 한화투자증권 = "003530"
    # 한국전력 = "015760"
    # 한미반도체 = "042700"
    # 신성이엔지 = "011930"
    # 금양 = "001570"
    # 코오롱모빌리티그룹 = "450140"
    # 엘브이엠씨홀딩스 = "900140"
    # 신한지주 = "055550"
    # 이수화학 = "005950"
    # 삼화전기 = "009470"
    # 삼부토건 = "001470"
    # 한화생명 = "088350"
    # 우리금융지주 = "316140"
    # 기아 = "000270"
